curvedDuctFlowPiso/opt/openfoam240/tutorials/multiphase/interFoam/ras/waterChannel/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

./Allmesh

cp 0/alpha.water.org 0/alpha.water
runApplication setFields

runApplication $application

# ----------------------------------------------------------------- end-of-file
